---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructConnectionColumnBase
source: html/e0e5b957-7cd5-33a7-2d9b-1605b1820139.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructConnectionColumnBase Property

"Base Connection"

## Syntax (C#)
```csharp
public static ForgeTypeId StructConnectionColumnBase { get; }
```